#include <stdio.h>
#include <math.h>

#define PI 3.14

int main ()
{
    float a, b, x, z, xb, xe, dx;
	printf(" (!) Внимание (!) \n");
	printf("Если значение функции невычисляемо, в ячейке будет отображено число 666.666 .\n");
    // Ввод значений
    printf("Введите значение a:     "); scanf("%f", &a);
    printf("Введите значение b:     "); scanf("%f", &b);
    printf("Введите значение x_нач: "); scanf("%f", &xb);
    printf("Введите значение x_кон: "); scanf("%f", &xe);
    printf("Введите значение dx:    "); scanf("%f", &dx);

    x = xb;

    if (x <= xe)
    {
        printf("\n+-----------------+----------------------------------+");
        printf("\n|   Значение X    |           z ( X ) = ...          |");
        printf("\n+-----------------+----------------------------------+");

        while (x <= xe)
        {
            // Расчёт значения функции
            if (x <= a)
            {
                z = ((pow(x, 3.5) * sin( pow(x, 2.2) ) <= 1.414) && x > 0) ? (sqrt( 1.414 - pow(x, 3.5) * sin( pow(x, 2.2) ) ) + log(x)) : 666.666;
            }
            else if (x < b)
            {
                z = 2 * exp(3.14 * x) * sin( 2.1 * x - PI / 5 );
            }
            else
            {
                z = (x >= 0) ? ( fabs( pow(x, 5.1) * cosh(x) - 1.4 ) * atan( pow(x, 2.6) ) ) : 666.666;
            }

            // Вывод значения
            printf("\n| %15f | %32f |", x, z);

            x += dx;
        }

        printf("\n+-----------------+----------------------------------+");
    } else {
        printf("Начальное значение больше конечного.");
    }
    printf("\nПрограмма завершила свою работу....\n");
    
    return 0;
}